MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256DA210/mcu.h
extern volatile G1DPADRHBITS G1DPADRHbits __attribute__((__sfr__));

#define G1DPW G1DPW
extern volatile uint16_t G1DPW __attribute__((__sfr__));
__extension__ typedef struct tagG1DPWBITS {
  union {
    struct {
      uint16_t DPW:11;
    };
    struct {
      uint16_t DPW0:1;
      uint16_t DPW1:1;
      uint16_t DPW2:1;
      uint16_t DPW3:1;
      uint16_t DPW4:1;
      uint16_t DPW5:1;
      uint16_t DPW6:1;
      uint16_t DPW7:1;
      uint16_t DPW8:1;
      uint16_t DPW9:1;
      uint16_t DPW10:1;
    };
  };
} G1DPWBITS;
extern volatile G1DPWBITS G1DPWbits __attribute__((__sfr__));

#define G1DPH G1DPH
extern volatile uint16_t G1DPH __attribute__((__sfr__));
__extension__ typedef struct tagG1DPHBITS {
  union {
    struct {
      uint16_t DPH:11;
    };
    struct {
      uint16_t DPH0:1;
      uint16_t DPH1:1;
      uint16_t DPH2:1;
      uint16_t DPH3:1;
      uint16_t DPH4:1;
      uint16_t DPH5:1;
      uint16_t DPH6:1;
      uint16_t DPH7:1;
      uint16_t DPH8:1;
      uint16_t DPH9:1;
      uint16_t DPH10:1;
    };
  };
} G1DPHBITS;
extern volatile G1DPHBITS G1DPHbits __attribute__((__sfr__));

#define G1DPWT G1DPWT
extern volatile uint16_t G1DPWT __attribute__((__sfr__));
__extension__ typedef struct tagG1DPWTBITS {
  union {
    struct {
      uint16_t DPWT:11;
    };
    struct {
      uint16_t DPWT0:1;
      uint16_t DPWT1:1;
      uint16_t DPWT2:1;
      uint16_t DPWT3:1;
      uint16_t DPWT4:1;
      uint16_t DPWT5:1;
      uint16_t DPWT6:1;
      uint16_t DPWT7:1;
      uint16_t DPWT8:1;
      uint16_t DPWT9:1;
      uint16_t DPWT10:1;
    };
  };
} G1DPWTBITS;
extern volatile G1DPWTBITS G1DPWTbits __attribute__((__sfr__));

#define G1DPHT G1DPHT
extern volatile uint16_t G1DPHT __attribute__((__sfr__));
__extension__ typedef struct tagG1DPHTBITS {
  union {
    struct {
      uint16_t DPHT:11;
    };
    struct {
      uint16_t DPHT0:1;
      uint16_t DPHT1:1;
      uint16_t DPHT2:1;
      uint16_t DPHT3:1;
      uint16_t DPHT4:1;
      uint16_t DPHT5:1;
      uint16_t DPHT6:1;
      uint16_t DPHT7:1;
      uint16_t DPHT8:1;
      uint16_t DPHT9:1;
      uint16_t DPHT10:1;
    };
  };
} G1DPHTBITS;
extern volatile G1DPHTBITS G1DPHTbits __attribute__((__sfr__));

#define G1CON2 G1CON2
extern volatile uint16_t G1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagG1CON2BITS {
  union {
    struct {
      uint16_t DPMODE:3;
      uint16_t :2;
      uint16_t DPBPP:3;
      uint16_t DPTEST:2;
      uint16_t :2;
      uint16_t DPSTGER:2;
      uint16_t DPGWDTH:2;
    };
    struct {
      uint16_t DPMODE0:1;
      uint16_t DPMODE1:1;
      uint16_t DPMODE2:1;
      uint16_t :2;
      uint16_t DPBPP0:1;
      uint16_t DPBPP1:1;
      uint16_t DPBPP2:1;
      uint16_t DPTEST0:1;
      uint16_t DPTEST1:1;
      uint16_t :2;
      uint16_t DPSTGER0:1;
      uint16_t DPSTGER1:1;
      uint16_t DPGWDTH0:1;
      uint16_t DPGWDTH1:1;
    };
  };
} G1CON2BITS;
extern volatile G1CON2BITS G1CON2bits __attribute__((__sfr__));

#define G1CON3 G1CON3
extern volatile uint16_t G1CON3 __attribute__((__sfr__));
typedef struct tagG1CON3BITS {
  uint16_t DPHSOE:1;
  uint16_t DPVSOE:1;
  uint16_t DPENOE:1;
  uint16_t DPPWROE:1;
  uint16_t DPHSPOL:1;
  uint16_t DPVSPOL:1;
  uint16_t DPENPOL:1;
  uint16_t DPCLKPOL:1;
  uint16_t DPPOWER:1;
  uint16_t DPPINOE:1;
} G1CON3BITS;
extern volatile G1CON3BITS G1CON3bits __attribute__((__sfr__));

#define G1ACTDA G1ACTDA
extern volatile uint16_t G1ACTDA __attribute__((__sfr__));
__extension__ typedef struct tagG1ACTDABITS {
  union {
    struct {
      uint16_t ACTPIX:8;
      uint16_t ACTLINE:8;
    };
    struct {
      uint16_t ACTPIX0:1;
      uint16_t ACTPIX1:1;
      uint16_t ACTPIX2:1;
      uint16_t ACTPIX3:1;
      uint16_t ACTPIX4:1;
      uint16_t ACTPIX5:1;
      uint16_t ACTPIX6:1;
      uint16_t ACTPIX7:1;
      uint16_t ACTLINE0:1;
      uint16_t ACTLINE1:1;
      uint16_t ACTLINE2:1;
      uint16_t ACTLINE3:1;
      uint16_t ACTLINE4:1;
      uint16_t ACTLINE5:1;
      uint16_t ACTLINE6:1;
      uint16_t ACTLINE7:1;
    };
  };
} G1ACTDABITS;
extern volatile G1ACTDABITS G1ACTDAbits __attribute__((__sfr__));

#define G1HSYNC G1HSYNC
extern volatile uint16_t G1HSYNC __attribute__((__sfr__));
__extension__ typedef struct tagG1HSYNCBITS {
  union {
    struct {
      uint16_t HSST:8;
      uint16_t HSLEN:8;
    };
    struct {
      uint16_t HSST0:1;
      uint16_t HSST1:1;
      uint16_t HSST2:1;
      uint16_t HSST3:1;
      uint16_t HSST4:1;
      uint16_t HSST5:1;
      uint16_t HSST6:1;
      uint16_t HSST7:1;
      uint16_t HSLEN0:1;
      uint16_t HSLEN1:1;
      uint16_t HSLEN2:1;
      uint16_t HSLEN3:1;
      uint16_t HSLEN4:1;
      uint16_t HSLEN5:1;
      uint16_t HSLEN6:1;
      uint16_t HSLEN7:1;
    };
  };
} G1HSYNCBITS;
extern volatile G1HSYNCBITS G1HSYNCbits __attribute__((__sfr__));

#define G1VSYNC G1VSYNC
extern volatile uint16_t G1VSYNC __attribute__((__sfr__));
__extension__ typedef struct tagG1VSYNCBITS {
  union {
    struct {
      uint16_t VSST:8;
      uint16_t VSLEN:8;
    };
    struct {
      uint16_t VSST0:1;
      uint16_t VSST1:1;
      uint16_t VSST2:1;
      uint16_t VSST3:1;
      uint16_t VSST4:1;
      uint16_t VSST5:1;
      uint16_t VSST6:1;
      uint16_t VSST7:1;
      uint16_t VSLEN0:1;
      uint16_t VSLEN1:1;
      uint16_t VSLEN2:1;
      uint16_t VSLEN3:1;
      uint16_t VSLEN4:1;
      uint16_t VSLEN5:1;
      uint16_t VSLEN6:1;
      uint16_t VSLEN7:1;
    };
  };
} G1VSYNCBITS;
extern volatile G1VSYNCBITS G1VSYNCbits __attribute__((__sfr__));

#define G1DBLCON G1DBLCON
extern volatile uint16_t G1DBLCON __attribute__((__sfr__));
__extension__ typedef struct tagG1DBLCONBITS {
  union {
    struct {
      uint16_t HENST:8;
      uint16_t VENST:8;
    };
    struct {
      uint16_t HENST0:1;
      uint16_t HENST1:1;
      uint16_t HENST2:1;
      uint16_t HENST3:1;
      uint16_t HENST4:1;
      uint16_t HENST5:1;
      uint16_t HENST6:1;
      uint16_t HENST7:1;
      uint16_t VENST0:1;
      uint16_t VENST1:1;
      uint16_t VENST2:1;
      uint16_t VENST3:1;
      uint16_t VENST4:1;
      uint16_t VENST5:1;
      uint16_t VENST6:1;
      uint16_t VENST7:1;
    };
  };
} G1DBLCONBITS;
extern volatile G1DBLCONBITS G1DBLCONbits __attribute__((__sfr__));

