MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256DA210/mcu.h
/* U1EP8 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP9 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP10 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP11 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP12 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP13 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP14 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP15 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1PWMRRS */
#define _PER U1PWMRRSbits.PER
/* Bitname _DC cannot be defined because it is used by more than one SFR */
#define _PER0 U1PWMRRSbits.PER0
#define _PER1 U1PWMRRSbits.PER1
#define _PER2 U1PWMRRSbits.PER2
#define _PER3 U1PWMRRSbits.PER3
#define _PER4 U1PWMRRSbits.PER4
#define _PER5 U1PWMRRSbits.PER5
#define _PER6 U1PWMRRSbits.PER6
#define _PER7 U1PWMRRSbits.PER7
#define _DC0 U1PWMRRSbits.DC0
#define _DC1 U1PWMRRSbits.DC1
#define _DC2 U1PWMRRSbits.DC2
#define _DC3 U1PWMRRSbits.DC3
#define _DC4 U1PWMRRSbits.DC4
#define _DC5 U1PWMRRSbits.DC5
#define _DC6 U1PWMRRSbits.DC6
#define _DC7 U1PWMRRSbits.DC7
#define _USBRS0 U1PWMRRSbits.USBRS0
#define _USBRS1 U1PWMRRSbits.USBRS1
#define _USBRS2 U1PWMRRSbits.USBRS2
#define _USBRS3 U1PWMRRSbits.USBRS3
#define _USBRS4 U1PWMRRSbits.USBRS4
#define _USBRS5 U1PWMRRSbits.USBRS5
#define _USBRS6 U1PWMRRSbits.USBRS6
#define _USBRS7 U1PWMRRSbits.USBRS7
#define _USBR0 U1PWMRRSbits.USBR0
#define _USBR1 U1PWMRRSbits.USBR1
#define _USBR2 U1PWMRRSbits.USBR2
#define _USBR3 U1PWMRRSbits.USBR3
#define _USBR4 U1PWMRRSbits.USBR4
#define _USBR5 U1PWMRRSbits.USBR5
#define _USBR6 U1PWMRRSbits.USBR6
#define _USBR7 U1PWMRRSbits.USBR7
#define _USBRS U1PWMRRSbits.USBRS
#define _USBR U1PWMRRSbits.USBR

/* U1PWMCON */
#define _CNTEN U1PWMCONbits.CNTEN
#define _PWMPOL U1PWMCONbits.PWMPOL
#define _PWMEN U1PWMCONbits.PWMEN

/* ANCFG */
#define _VBGEN ANCFGbits.VBGEN
#define _VBG2EN ANCFGbits.VBG2EN
#define _VBG6EN ANCFGbits.VBG6EN

/* ANSA */
#define _ANSA6 ANSAbits.ANSA6
#define _ANSA7 ANSAbits.ANSA7
#define _ANSA9 ANSAbits.ANSA9
#define _ANSA10 ANSAbits.ANSA10

/* ANSB */
#define _ANSB0 ANSBbits.ANSB0
#define _ANSB1 ANSBbits.ANSB1
#define _ANSB2 ANSBbits.ANSB2
#define _ANSB3 ANSBbits.ANSB3
#define _ANSB4 ANSBbits.ANSB4
#define _ANSB5 ANSBbits.ANSB5
#define _ANSB6 ANSBbits.ANSB6
#define _ANSB7 ANSBbits.ANSB7
#define _ANSB8 ANSBbits.ANSB8
#define _ANSB9 ANSBbits.ANSB9
#define _ANSB10 ANSBbits.ANSB10
#define _ANSB11 ANSBbits.ANSB11
#define _ANSB12 ANSBbits.ANSB12
#define _ANSB13 ANSBbits.ANSB13
#define _ANSB14 ANSBbits.ANSB14
#define _ANSB15 ANSBbits.ANSB15

