MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256DA210/mcu.h
/* G1CLUT */
#define _CLUTADR G1CLUTbits.CLUTADR
#define _CLUTRWEN G1CLUTbits.CLUTRWEN
#define _CLUTTRD G1CLUTbits.CLUTTRD
#define _CLUTBUSY G1CLUTbits.CLUTBUSY
#define _CLUTEN G1CLUTbits.CLUTEN
#define _CLUTADR0 G1CLUTbits.CLUTADR0
#define _CLUTADR1 G1CLUTbits.CLUTADR1
#define _CLUTADR2 G1CLUTbits.CLUTADR2
#define _CLUTADR3 G1CLUTbits.CLUTADR3
#define _CLUTADR4 G1CLUTbits.CLUTADR4
#define _CLUTADR5 G1CLUTbits.CLUTADR5
#define _CLUTADR6 G1CLUTbits.CLUTADR6
#define _CLUTADR7 G1CLUTbits.CLUTADR7

/* G1CLUTWR */
#define _CLUTWR G1CLUTWRbits.CLUTWR
#define _CLUTWR0 G1CLUTWRbits.CLUTWR0
#define _CLUTWR1 G1CLUTWRbits.CLUTWR1
#define _CLUTWR2 G1CLUTWRbits.CLUTWR2
#define _CLUTWR3 G1CLUTWRbits.CLUTWR3
#define _CLUTWR4 G1CLUTWRbits.CLUTWR4
#define _CLUTWR5 G1CLUTWRbits.CLUTWR5
#define _CLUTWR6 G1CLUTWRbits.CLUTWR6
#define _CLUTWR7 G1CLUTWRbits.CLUTWR7
#define _CLUTWR8 G1CLUTWRbits.CLUTWR8
#define _CLUTWR9 G1CLUTWRbits.CLUTWR9
#define _CLUTWR10 G1CLUTWRbits.CLUTWR10
#define _CLUTWR11 G1CLUTWRbits.CLUTWR11
#define _CLUTWR12 G1CLUTWRbits.CLUTWR12
#define _CLUTWR13 G1CLUTWRbits.CLUTWR13
#define _CLUTWR14 G1CLUTWRbits.CLUTWR14
#define _CLUTWR15 G1CLUTWRbits.CLUTWR15

/* G1CLUTRD */
#define _CLUTRD G1CLUTRDbits.CLUTRD
#define _CLUTRD0 G1CLUTRDbits.CLUTRD0
#define _CLUTRD1 G1CLUTRDbits.CLUTRD1
#define _CLUTRD2 G1CLUTRDbits.CLUTRD2
#define _CLUTRD3 G1CLUTRDbits.CLUTRD3
#define _CLUTRD4 G1CLUTRDbits.CLUTRD4
#define _CLUTRD5 G1CLUTRDbits.CLUTRD5
#define _CLUTRD6 G1CLUTRDbits.CLUTRD6
#define _CLUTRD7 G1CLUTRDbits.CLUTRD7
#define _CLUTRD8 G1CLUTRDbits.CLUTRD8
#define _CLUTRD9 G1CLUTRDbits.CLUTRD9
#define _CLUTRD10 G1CLUTRDbits.CLUTRD10
#define _CLUTRD11 G1CLUTRDbits.CLUTRD11
#define _CLUTRD12 G1CLUTRDbits.CLUTRD12
#define _CLUTRD13 G1CLUTRDbits.CLUTRD13
#define _CLUTRD14 G1CLUTRDbits.CLUTRD14
#define _CLUTRD15 G1CLUTRDbits.CLUTRD15

/* G1MRGN */
#define _HBAMGN G1MRGNbits.HBAMGN
#define _VBAMGN G1MRGNbits.VBAMGN
#define _HBAMGN0 G1MRGNbits.HBAMGN0
#define _HBAMGN1 G1MRGNbits.HBAMGN1
#define _HBAMGN2 G1MRGNbits.HBAMGN2
#define _HBAMGN3 G1MRGNbits.HBAMGN3
#define _HBAMGN4 G1MRGNbits.HBAMGN4
#define _HBAMGN5 G1MRGNbits.HBAMGN5
#define _HBAMGN6 G1MRGNbits.HBAMGN6
#define _HBAMGN7 G1MRGNbits.HBAMGN7
#define _VBAMGN0 G1MRGNbits.VBAMGN0
#define _VBAMGN1 G1MRGNbits.VBAMGN1
#define _VBAMGN2 G1MRGNbits.VBAMGN2
#define _VBAMGN3 G1MRGNbits.VBAMGN3
#define _VBAMGN4 G1MRGNbits.VBAMGN4
#define _VBAMGN5 G1MRGNbits.VBAMGN5
#define _VBAMGN6 G1MRGNbits.VBAMGN6
#define _VBAMGN7 G1MRGNbits.VBAMGN7

/* G1CHRX */
#define _CURPOSX G1CHRXbits.CURPOSX
#define _CURPOSX0 G1CHRXbits.CURPOSX0
#define _CURPOSX1 G1CHRXbits.CURPOSX1
#define _CURPOSX2 G1CHRXbits.CURPOSX2
#define _CURPOSX3 G1CHRXbits.CURPOSX3
#define _CURPOSX4 G1CHRXbits.CURPOSX4
#define _CURPOSX5 G1CHRXbits.CURPOSX5
#define _CURPOSX6 G1CHRXbits.CURPOSX6
#define _CURPOSX7 G1CHRXbits.CURPOSX7
#define _CURPOSX8 G1CHRXbits.CURPOSX8
#define _CURPOSX9 G1CHRXbits.CURPOSX9
#define _CURPOSX10 G1CHRXbits.CURPOSX10

/* G1CHRY */
#define _CURPOSY G1CHRYbits.CURPOSY
#define _CURPOSY0 G1CHRYbits.CURPOSY0
#define _CURPOSY1 G1CHRYbits.CURPOSY1
#define _CURPOSY2 G1CHRYbits.CURPOSY2
#define _CURPOSY3 G1CHRYbits.CURPOSY3
#define _CURPOSY4 G1CHRYbits.CURPOSY4
#define _CURPOSY5 G1CHRYbits.CURPOSY5
#define _CURPOSY6 G1CHRYbits.CURPOSY6
#define _CURPOSY7 G1CHRYbits.CURPOSY7
#define _CURPOSY8 G1CHRYbits.CURPOSY8
#define _CURPOSY9 G1CHRYbits.CURPOSY9
#define _CURPOSY10 G1CHRYbits.CURPOSY10

/* G1IPU */
#define _BFINAL G1IPUbits.BFINAL
#define _IPUDONE G1IPUbits.IPUDONE
#define _WRAPERR G1IPUbits.WRAPERR
#define _LENERR G1IPUbits.LENERR
#define _BLCKERR G1IPUbits.BLCKERR
#define _HUFFERR G1IPUbits.HUFFERR

/* G1DBEN */
#define _GDBEN G1DBENbits.GDBEN
#define _GDBEN0 G1DBENbits.GDBEN0
#define _GDBEN1 G1DBENbits.GDBEN1
#define _GDBEN2 G1DBENbits.GDBEN2
#define _GDBEN3 G1DBENbits.GDBEN3
#define _GDBEN4 G1DBENbits.GDBEN4
#define _GDBEN5 G1DBENbits.GDBEN5
#define _GDBEN6 G1DBENbits.GDBEN6
#define _GDBEN7 G1DBENbits.GDBEN7
#define _GDBEN8 G1DBENbits.GDBEN8
#define _GDBEN9 G1DBENbits.GDBEN9
#define _GDBEN10 G1DBENbits.GDBEN10
#define _GDBEN11 G1DBENbits.GDBEN11
#define _GDBEN12 G1DBENbits.GDBEN12
#define _GDBEN13 G1DBENbits.GDBEN13
#define _GDBEN14 G1DBENbits.GDBEN14
#define _GDBEN15 G1DBENbits.GDBEN15

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _VREGS RCONbits.VREGS
#define _CM RCONbits.CM
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR
#define _PMSLP RCONbits.PMSLP

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _SOSCEN OSCCONbits.SOSCEN
#define _POSCEN OSCCONbits.POSCEN
#define _CF OSCCONbits.CF
#define _LOCK OSCCONbits.LOCK
#define _IOLOCK OSCCONbits.IOLOCK
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _LPOSCEN OSCCONbits.LPOSCEN
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* CLKDIV */
#define _G1CLKSEL CLKDIVbits.G1CLKSEL
#define _PLLEN CLKDIVbits.PLLEN
#define _CPDIV CLKDIVbits.CPDIV
#define _RCDIV CLKDIVbits.RCDIV
#define _DOZEN CLKDIVbits.DOZEN
#define _DOZE CLKDIVbits.DOZE
#define _ROI CLKDIVbits.ROI
#define _CPDIV0 CLKDIVbits.CPDIV0
#define _CPDIV1 CLKDIVbits.CPDIV1
#define _RCDIV0 CLKDIVbits.RCDIV0
#define _RCDIV1 CLKDIVbits.RCDIV1
#define _RCDIV2 CLKDIVbits.RCDIV2
#define _DOZE0 CLKDIVbits.DOZE0
#define _DOZE1 CLKDIVbits.DOZE1
#define _DOZE2 CLKDIVbits.DOZE2

/* CLKDIV2 */
#define _GCLKDIV CLKDIV2bits.GCLKDIV
#define _GCLKDIV0 CLKDIV2bits.GCLKDIV0
#define _GCLKDIV1 CLKDIV2bits.GCLKDIV1
#define _GCLKDIV2 CLKDIV2bits.GCLKDIV2
#define _GCLKDIV3 CLKDIV2bits.GCLKDIV3
#define _GCLKDIV4 CLKDIV2bits.GCLKDIV4
#define _GCLKDIV5 CLKDIV2bits.GCLKDIV5
#define _GCLKDIV6 CLKDIV2bits.GCLKDIV6

/* OSCTUN */
#define _TUN OSCTUNbits.TUN
#define _TUN0 OSCTUNbits.TUN0
#define _TUN1 OSCTUNbits.TUN1
#define _TUN2 OSCTUNbits.TUN2
#define _TUN3 OSCTUNbits.TUN3
#define _TUN4 OSCTUNbits.TUN4
#define _TUN5 OSCTUNbits.TUN5

/* REFOCON */
#define _RODIV REFOCONbits.RODIV
#define _ROSEL REFOCONbits.ROSEL
#define _ROSSLP REFOCONbits.ROSSLP
#define _ROEN REFOCONbits.ROEN
#define _RODIV0 REFOCONbits.RODIV0
#define _RODIV1 REFOCONbits.RODIV1
#define _RODIV2 REFOCONbits.RODIV2
#define _RODIV3 REFOCONbits.RODIV3
#define _ROON REFOCONbits.ROON

/* NVMCON */
#define _NVMOP NVMCONbits.NVMOP
#define _ERASE NVMCONbits.ERASE
#define _WRERR NVMCONbits.WRERR
#define _WREN NVMCONbits.WREN
#define _WR NVMCONbits.WR
#define _NVMOP0 NVMCONbits.NVMOP0
#define _NVMOP1 NVMCONbits.NVMOP1
#define _NVMOP2 NVMCONbits.NVMOP2
#define _NVMOP3 NVMCONbits.NVMOP3
#define _PROGOP0 NVMCONbits.PROGOP0
#define _PROGOP1 NVMCONbits.PROGOP1
#define _PROGOP2 NVMCONbits.PROGOP2
#define _PROGOP3 NVMCONbits.PROGOP3
#define _PROGOP NVMCONbits.PROGOP

/* PMD1 */
#define _ADC1MD PMD1bits.ADC1MD
#define _SPI1MD PMD1bits.SPI1MD
#define _SPI2MD PMD1bits.SPI2MD
#define _U1MD PMD1bits.U1MD
#define _U2MD PMD1bits.U2MD
#define _I2C1MD PMD1bits.I2C1MD
#define _T1MD PMD1bits.T1MD
#define _T2MD PMD1bits.T2MD
#define _T3MD PMD1bits.T3MD
#define _T4MD PMD1bits.T4MD
#define _T5MD PMD1bits.T5MD

/* PMD2 */
#define _OC1MD PMD2bits.OC1MD
#define _OC2MD PMD2bits.OC2MD
#define _OC3MD PMD2bits.OC3MD
#define _OC4MD PMD2bits.OC4MD
#define _OC5MD PMD2bits.OC5MD
#define _OC6MD PMD2bits.OC6MD
#define _OC7MD PMD2bits.OC7MD
#define _OC8MD PMD2bits.OC8MD
#define _IC1MD PMD2bits.IC1MD
#define _IC2MD PMD2bits.IC2MD
#define _IC3MD PMD2bits.IC3MD
#define _IC4MD PMD2bits.IC4MD
#define _IC5MD PMD2bits.IC5MD
#define _IC6MD PMD2bits.IC6MD
#define _IC7MD PMD2bits.IC7MD
#define _IC8MD PMD2bits.IC8MD

/* PMD3 */
#define _I2C2MD PMD3bits.I2C2MD
#define _I2C3MD PMD3bits.I2C3MD
#define _U3MD PMD3bits.U3MD
#define _CRCMD PMD3bits.CRCMD
#define _PMPMD PMD3bits.PMPMD
#define _RTCCMD PMD3bits.RTCCMD
#define _CMPMD PMD3bits.CMPMD
#define _CRCPMD PMD3bits.CRCPMD

/* PMD4 */
#define _USB1MD PMD4bits.USB1MD
#define _LVDMD PMD4bits.LVDMD
#define _CTMUMD PMD4bits.CTMUMD
#define _REFOMD PMD4bits.REFOMD
#define _U4MD PMD4bits.U4MD
#define _UPWMMD PMD4bits.UPWMMD

/* PMD5 */
#define _OC9MD PMD5bits.OC9MD
#define _IC9MD PMD5bits.IC9MD

