MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256DA210/mcu.h
#define _CNEN2_CN30IE_POSITION                   0x0000000E
#define _CNEN2_CN30IE_MASK                       0x00004000
#define _CNEN2_CN30IE_LENGTH                     0x00000001

#define _CNEN2_CN31IE_POSITION                   0x0000000F
#define _CNEN2_CN31IE_MASK                       0x00008000
#define _CNEN2_CN31IE_LENGTH                     0x00000001

#define _CNEN3_CN32IE_POSITION                   0x00000000
#define _CNEN3_CN32IE_MASK                       0x00000001
#define _CNEN3_CN32IE_LENGTH                     0x00000001

#define _CNEN3_CN33IE_POSITION                   0x00000001
#define _CNEN3_CN33IE_MASK                       0x00000002
#define _CNEN3_CN33IE_LENGTH                     0x00000001

#define _CNEN3_CN34IE_POSITION                   0x00000002
#define _CNEN3_CN34IE_MASK                       0x00000004
#define _CNEN3_CN34IE_LENGTH                     0x00000001

#define _CNEN3_CN35IE_POSITION                   0x00000003
#define _CNEN3_CN35IE_MASK                       0x00000008
#define _CNEN3_CN35IE_LENGTH                     0x00000001

#define _CNEN3_CN36IE_POSITION                   0x00000004
#define _CNEN3_CN36IE_MASK                       0x00000010
#define _CNEN3_CN36IE_LENGTH                     0x00000001

#define _CNEN3_CN37IE_POSITION                   0x00000005
#define _CNEN3_CN37IE_MASK                       0x00000020
#define _CNEN3_CN37IE_LENGTH                     0x00000001

#define _CNEN3_CN38IE_POSITION                   0x00000006
#define _CNEN3_CN38IE_MASK                       0x00000040
#define _CNEN3_CN38IE_LENGTH                     0x00000001

#define _CNEN3_CN39IE_POSITION                   0x00000007
#define _CNEN3_CN39IE_MASK                       0x00000080
#define _CNEN3_CN39IE_LENGTH                     0x00000001

#define _CNEN3_CN40IE_POSITION                   0x00000008
#define _CNEN3_CN40IE_MASK                       0x00000100
#define _CNEN3_CN40IE_LENGTH                     0x00000001

#define _CNEN3_CN41IE_POSITION                   0x00000009
#define _CNEN3_CN41IE_MASK                       0x00000200
#define _CNEN3_CN41IE_LENGTH                     0x00000001

#define _CNEN3_CN42IE_POSITION                   0x0000000A
#define _CNEN3_CN42IE_MASK                       0x00000400
#define _CNEN3_CN42IE_LENGTH                     0x00000001

#define _CNEN3_CN43IE_POSITION                   0x0000000B
#define _CNEN3_CN43IE_MASK                       0x00000800
#define _CNEN3_CN43IE_LENGTH                     0x00000001

#define _CNEN3_CN44IE_POSITION                   0x0000000C
#define _CNEN3_CN44IE_MASK                       0x00001000
#define _CNEN3_CN44IE_LENGTH                     0x00000001

#define _CNEN3_CN45IE_POSITION                   0x0000000D
#define _CNEN3_CN45IE_MASK                       0x00002000
#define _CNEN3_CN45IE_LENGTH                     0x00000001

#define _CNEN3_CN46IE_POSITION                   0x0000000E
#define _CNEN3_CN46IE_MASK                       0x00004000
#define _CNEN3_CN46IE_LENGTH                     0x00000001

#define _CNEN3_CN47IE_POSITION                   0x0000000F
#define _CNEN3_CN47IE_MASK                       0x00008000
#define _CNEN3_CN47IE_LENGTH                     0x00000001

#define _CNEN4_CN48IE_POSITION                   0x00000000
#define _CNEN4_CN48IE_MASK                       0x00000001
#define _CNEN4_CN48IE_LENGTH                     0x00000001

#define _CNEN4_CN49IE_POSITION                   0x00000001
#define _CNEN4_CN49IE_MASK                       0x00000002
#define _CNEN4_CN49IE_LENGTH                     0x00000001

#define _CNEN4_CN50IE_POSITION                   0x00000002
#define _CNEN4_CN50IE_MASK                       0x00000004
#define _CNEN4_CN50IE_LENGTH                     0x00000001

#define _CNEN4_CN51IE_POSITION                   0x00000003
#define _CNEN4_CN51IE_MASK                       0x00000008
#define _CNEN4_CN51IE_LENGTH                     0x00000001

#define _CNEN4_CN52IE_POSITION                   0x00000004
#define _CNEN4_CN52IE_MASK                       0x00000010
#define _CNEN4_CN52IE_LENGTH                     0x00000001

#define _CNEN4_CN53IE_POSITION                   0x00000005
#define _CNEN4_CN53IE_MASK                       0x00000020
#define _CNEN4_CN53IE_LENGTH                     0x00000001

#define _CNEN4_CN54IE_POSITION                   0x00000006
#define _CNEN4_CN54IE_MASK                       0x00000040
#define _CNEN4_CN54IE_LENGTH                     0x00000001

#define _CNEN4_CN55IE_POSITION                   0x00000007
#define _CNEN4_CN55IE_MASK                       0x00000080
#define _CNEN4_CN55IE_LENGTH                     0x00000001

#define _CNEN4_CN56IE_POSITION                   0x00000008
#define _CNEN4_CN56IE_MASK                       0x00000100
#define _CNEN4_CN56IE_LENGTH                     0x00000001

#define _CNEN4_CN57IE_POSITION                   0x00000009
#define _CNEN4_CN57IE_MASK                       0x00000200
#define _CNEN4_CN57IE_LENGTH                     0x00000001

#define _CNEN4_CN58IE_POSITION                   0x0000000A
#define _CNEN4_CN58IE_MASK                       0x00000400
#define _CNEN4_CN58IE_LENGTH                     0x00000001

#define _CNEN4_CN59IE_POSITION                   0x0000000B
#define _CNEN4_CN59IE_MASK                       0x00000800
#define _CNEN4_CN59IE_LENGTH                     0x00000001

#define _CNEN4_CN60IE_POSITION                   0x0000000C
#define _CNEN4_CN60IE_MASK                       0x00001000
#define _CNEN4_CN60IE_LENGTH                     0x00000001

#define _CNEN4_CN61IE_POSITION                   0x0000000D
#define _CNEN4_CN61IE_MASK                       0x00002000
#define _CNEN4_CN61IE_LENGTH                     0x00000001

#define _CNEN4_CN62IE_POSITION                   0x0000000E
#define _CNEN4_CN62IE_MASK                       0x00004000
#define _CNEN4_CN62IE_LENGTH                     0x00000001

#define _CNEN4_CN63IE_POSITION                   0x0000000F
#define _CNEN4_CN63IE_MASK                       0x00008000
#define _CNEN4_CN63IE_LENGTH                     0x00000001

