MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256DA210/mcu.h
#define _RPINR11_OCFBR3_POSITION                 0x0000000B
#define _RPINR11_OCFBR3_MASK                     0x00000800
#define _RPINR11_OCFBR3_LENGTH                   0x00000001

#define _RPINR11_OCFBR4_POSITION                 0x0000000C
#define _RPINR11_OCFBR4_MASK                     0x00001000
#define _RPINR11_OCFBR4_LENGTH                   0x00000001

#define _RPINR11_OCFBR5_POSITION                 0x0000000D
#define _RPINR11_OCFBR5_MASK                     0x00002000
#define _RPINR11_OCFBR5_LENGTH                   0x00000001

#define _RPINR15_IC9R_POSITION                   0x00000008
#define _RPINR15_IC9R_MASK                       0x00003F00
#define _RPINR15_IC9R_LENGTH                     0x00000006

#define _RPINR15_IC9R0_POSITION                  0x00000008
#define _RPINR15_IC9R0_MASK                      0x00000100
#define _RPINR15_IC9R0_LENGTH                    0x00000001

#define _RPINR15_IC9R1_POSITION                  0x00000009
#define _RPINR15_IC9R1_MASK                      0x00000200
#define _RPINR15_IC9R1_LENGTH                    0x00000001

#define _RPINR15_IC9R2_POSITION                  0x0000000A
#define _RPINR15_IC9R2_MASK                      0x00000400
#define _RPINR15_IC9R2_LENGTH                    0x00000001

#define _RPINR15_IC9R3_POSITION                  0x0000000B
#define _RPINR15_IC9R3_MASK                      0x00000800
#define _RPINR15_IC9R3_LENGTH                    0x00000001

#define _RPINR15_IC9R4_POSITION                  0x0000000C
#define _RPINR15_IC9R4_MASK                      0x00001000
#define _RPINR15_IC9R4_LENGTH                    0x00000001

#define _RPINR15_IC9R5_POSITION                  0x0000000D
#define _RPINR15_IC9R5_MASK                      0x00002000
#define _RPINR15_IC9R5_LENGTH                    0x00000001

#define _RPINR17_U3RXR_POSITION                  0x00000008
#define _RPINR17_U3RXR_MASK                      0x00003F00
#define _RPINR17_U3RXR_LENGTH                    0x00000006

#define _RPINR17_U3RXR0_POSITION                 0x00000008
#define _RPINR17_U3RXR0_MASK                     0x00000100
#define _RPINR17_U3RXR0_LENGTH                   0x00000001

#define _RPINR17_U3RXR1_POSITION                 0x00000009
#define _RPINR17_U3RXR1_MASK                     0x00000200
#define _RPINR17_U3RXR1_LENGTH                   0x00000001

#define _RPINR17_U3RXR2_POSITION                 0x0000000A
#define _RPINR17_U3RXR2_MASK                     0x00000400
#define _RPINR17_U3RXR2_LENGTH                   0x00000001

#define _RPINR17_U3RXR3_POSITION                 0x0000000B
#define _RPINR17_U3RXR3_MASK                     0x00000800
#define _RPINR17_U3RXR3_LENGTH                   0x00000001

#define _RPINR17_U3RXR4_POSITION                 0x0000000C
#define _RPINR17_U3RXR4_MASK                     0x00001000
#define _RPINR17_U3RXR4_LENGTH                   0x00000001

#define _RPINR17_U3RXR5_POSITION                 0x0000000D
#define _RPINR17_U3RXR5_MASK                     0x00002000
#define _RPINR17_U3RXR5_LENGTH                   0x00000001

#define _RPINR18_U1RXR_POSITION                  0x00000000
#define _RPINR18_U1RXR_MASK                      0x0000003F
#define _RPINR18_U1RXR_LENGTH                    0x00000006

#define _RPINR18_U1CTSR_POSITION                 0x00000008
#define _RPINR18_U1CTSR_MASK                     0x00003F00
#define _RPINR18_U1CTSR_LENGTH                   0x00000006

#define _RPINR18_U1RXR0_POSITION                 0x00000000
#define _RPINR18_U1RXR0_MASK                     0x00000001
#define _RPINR18_U1RXR0_LENGTH                   0x00000001

#define _RPINR18_U1RXR1_POSITION                 0x00000001
#define _RPINR18_U1RXR1_MASK                     0x00000002
#define _RPINR18_U1RXR1_LENGTH                   0x00000001

#define _RPINR18_U1RXR2_POSITION                 0x00000002
#define _RPINR18_U1RXR2_MASK                     0x00000004
#define _RPINR18_U1RXR2_LENGTH                   0x00000001

#define _RPINR18_U1RXR3_POSITION                 0x00000003
#define _RPINR18_U1RXR3_MASK                     0x00000008
#define _RPINR18_U1RXR3_LENGTH                   0x00000001

#define _RPINR18_U1RXR4_POSITION                 0x00000004
#define _RPINR18_U1RXR4_MASK                     0x00000010
#define _RPINR18_U1RXR4_LENGTH                   0x00000001

#define _RPINR18_U1RXR5_POSITION                 0x00000005
#define _RPINR18_U1RXR5_MASK                     0x00000020
#define _RPINR18_U1RXR5_LENGTH                   0x00000001

#define _RPINR18_U1CTSR0_POSITION                0x00000008
#define _RPINR18_U1CTSR0_MASK                    0x00000100
#define _RPINR18_U1CTSR0_LENGTH                  0x00000001

#define _RPINR18_U1CTSR1_POSITION                0x00000009
#define _RPINR18_U1CTSR1_MASK                    0x00000200
#define _RPINR18_U1CTSR1_LENGTH                  0x00000001

#define _RPINR18_U1CTSR2_POSITION                0x0000000A
#define _RPINR18_U1CTSR2_MASK                    0x00000400
#define _RPINR18_U1CTSR2_LENGTH                  0x00000001

#define _RPINR18_U1CTSR3_POSITION                0x0000000B
#define _RPINR18_U1CTSR3_MASK                    0x00000800
#define _RPINR18_U1CTSR3_LENGTH                  0x00000001

#define _RPINR18_U1CTSR4_POSITION                0x0000000C
#define _RPINR18_U1CTSR4_MASK                    0x00001000
#define _RPINR18_U1CTSR4_LENGTH                  0x00000001

#define _RPINR18_U1CTSR5_POSITION                0x0000000D
#define _RPINR18_U1CTSR5_MASK                    0x00002000
#define _RPINR18_U1CTSR5_LENGTH                  0x00000001

#define _RPINR19_U2RXR_POSITION                  0x00000000
#define _RPINR19_U2RXR_MASK                      0x0000003F
#define _RPINR19_U2RXR_LENGTH                    0x00000006

#define _RPINR19_U2CTSR_POSITION                 0x00000008
#define _RPINR19_U2CTSR_MASK                     0x00003F00
#define _RPINR19_U2CTSR_LENGTH                   0x00000006

#define _RPINR19_U2RXR0_POSITION                 0x00000000
#define _RPINR19_U2RXR0_MASK                     0x00000001
#define _RPINR19_U2RXR0_LENGTH                   0x00000001

#define _RPINR19_U2RXR1_POSITION                 0x00000001
#define _RPINR19_U2RXR1_MASK                     0x00000002
#define _RPINR19_U2RXR1_LENGTH                   0x00000001

