MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256DA210/mcu.h
#define _CLKDIV_DOZEN_POSITION                   0x0000000B
#define _CLKDIV_DOZEN_MASK                       0x00000800
#define _CLKDIV_DOZEN_LENGTH                     0x00000001

#define _CLKDIV_DOZE_POSITION                    0x0000000C
#define _CLKDIV_DOZE_MASK                        0x00007000
#define _CLKDIV_DOZE_LENGTH                      0x00000003

#define _CLKDIV_ROI_POSITION                     0x0000000F
#define _CLKDIV_ROI_MASK                         0x00008000
#define _CLKDIV_ROI_LENGTH                       0x00000001

#define _CLKDIV_CPDIV0_POSITION                  0x00000006
#define _CLKDIV_CPDIV0_MASK                      0x00000040
#define _CLKDIV_CPDIV0_LENGTH                    0x00000001

#define _CLKDIV_CPDIV1_POSITION                  0x00000007
#define _CLKDIV_CPDIV1_MASK                      0x00000080
#define _CLKDIV_CPDIV1_LENGTH                    0x00000001

#define _CLKDIV_RCDIV0_POSITION                  0x00000008
#define _CLKDIV_RCDIV0_MASK                      0x00000100
#define _CLKDIV_RCDIV0_LENGTH                    0x00000001

#define _CLKDIV_RCDIV1_POSITION                  0x00000009
#define _CLKDIV_RCDIV1_MASK                      0x00000200
#define _CLKDIV_RCDIV1_LENGTH                    0x00000001

#define _CLKDIV_RCDIV2_POSITION                  0x0000000A
#define _CLKDIV_RCDIV2_MASK                      0x00000400
#define _CLKDIV_RCDIV2_LENGTH                    0x00000001

#define _CLKDIV_DOZE0_POSITION                   0x0000000C
#define _CLKDIV_DOZE0_MASK                       0x00001000
#define _CLKDIV_DOZE0_LENGTH                     0x00000001

#define _CLKDIV_DOZE1_POSITION                   0x0000000D
#define _CLKDIV_DOZE1_MASK                       0x00002000
#define _CLKDIV_DOZE1_LENGTH                     0x00000001

#define _CLKDIV_DOZE2_POSITION                   0x0000000E
#define _CLKDIV_DOZE2_MASK                       0x00004000
#define _CLKDIV_DOZE2_LENGTH                     0x00000001

#define _CLKDIV2_GCLKDIV_POSITION                0x00000009
#define _CLKDIV2_GCLKDIV_MASK                    0x0000FE00
#define _CLKDIV2_GCLKDIV_LENGTH                  0x00000007

#define _CLKDIV2_GCLKDIV0_POSITION               0x00000009
#define _CLKDIV2_GCLKDIV0_MASK                   0x00000200
#define _CLKDIV2_GCLKDIV0_LENGTH                 0x00000001

#define _CLKDIV2_GCLKDIV1_POSITION               0x0000000A
#define _CLKDIV2_GCLKDIV1_MASK                   0x00000400
#define _CLKDIV2_GCLKDIV1_LENGTH                 0x00000001

#define _CLKDIV2_GCLKDIV2_POSITION               0x0000000B
#define _CLKDIV2_GCLKDIV2_MASK                   0x00000800
#define _CLKDIV2_GCLKDIV2_LENGTH                 0x00000001

#define _CLKDIV2_GCLKDIV3_POSITION               0x0000000C
#define _CLKDIV2_GCLKDIV3_MASK                   0x00001000
#define _CLKDIV2_GCLKDIV3_LENGTH                 0x00000001

#define _CLKDIV2_GCLKDIV4_POSITION               0x0000000D
#define _CLKDIV2_GCLKDIV4_MASK                   0x00002000
#define _CLKDIV2_GCLKDIV4_LENGTH                 0x00000001

#define _CLKDIV2_GCLKDIV5_POSITION               0x0000000E
#define _CLKDIV2_GCLKDIV5_MASK                   0x00004000
#define _CLKDIV2_GCLKDIV5_LENGTH                 0x00000001

#define _CLKDIV2_GCLKDIV6_POSITION               0x0000000F
#define _CLKDIV2_GCLKDIV6_MASK                   0x00008000
#define _CLKDIV2_GCLKDIV6_LENGTH                 0x00000001

#define _OSCTUN_TUN_POSITION                     0x00000000
#define _OSCTUN_TUN_MASK                         0x0000003F
#define _OSCTUN_TUN_LENGTH                       0x00000006

#define _OSCTUN_TUN0_POSITION                    0x00000000
#define _OSCTUN_TUN0_MASK                        0x00000001
#define _OSCTUN_TUN0_LENGTH                      0x00000001

#define _OSCTUN_TUN1_POSITION                    0x00000001
#define _OSCTUN_TUN1_MASK                        0x00000002
#define _OSCTUN_TUN1_LENGTH                      0x00000001

#define _OSCTUN_TUN2_POSITION                    0x00000002
#define _OSCTUN_TUN2_MASK                        0x00000004
#define _OSCTUN_TUN2_LENGTH                      0x00000001

#define _OSCTUN_TUN3_POSITION                    0x00000003
#define _OSCTUN_TUN3_MASK                        0x00000008
#define _OSCTUN_TUN3_LENGTH                      0x00000001

#define _OSCTUN_TUN4_POSITION                    0x00000004
#define _OSCTUN_TUN4_MASK                        0x00000010
#define _OSCTUN_TUN4_LENGTH                      0x00000001

#define _OSCTUN_TUN5_POSITION                    0x00000005
#define _OSCTUN_TUN5_MASK                        0x00000020
#define _OSCTUN_TUN5_LENGTH                      0x00000001

#define _REFOCON_RODIV_POSITION                  0x00000008
#define _REFOCON_RODIV_MASK                      0x00000F00
#define _REFOCON_RODIV_LENGTH                    0x00000004

#define _REFOCON_ROSEL_POSITION                  0x0000000C
#define _REFOCON_ROSEL_MASK                      0x00001000
#define _REFOCON_ROSEL_LENGTH                    0x00000001

#define _REFOCON_ROSSLP_POSITION                 0x0000000D
#define _REFOCON_ROSSLP_MASK                     0x00002000
#define _REFOCON_ROSSLP_LENGTH                   0x00000001

#define _REFOCON_ROEN_POSITION                   0x0000000F
#define _REFOCON_ROEN_MASK                       0x00008000
#define _REFOCON_ROEN_LENGTH                     0x00000001

#define _REFOCON_RODIV0_POSITION                 0x00000008
#define _REFOCON_RODIV0_MASK                     0x00000100
#define _REFOCON_RODIV0_LENGTH                   0x00000001

#define _REFOCON_RODIV1_POSITION                 0x00000009
#define _REFOCON_RODIV1_MASK                     0x00000200
#define _REFOCON_RODIV1_LENGTH                   0x00000001

#define _REFOCON_RODIV2_POSITION                 0x0000000A
#define _REFOCON_RODIV2_MASK                     0x00000400
#define _REFOCON_RODIV2_LENGTH                   0x00000001

#define _REFOCON_RODIV3_POSITION                 0x0000000B
#define _REFOCON_RODIV3_MASK                     0x00000800
#define _REFOCON_RODIV3_LENGTH                   0x00000001

#define _REFOCON_ROON_POSITION                   0x0000000F
#define _REFOCON_ROON_MASK                       0x00008000
#define _REFOCON_ROON_LENGTH                     0x00000001

