MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256DA210/mcu.h
#define _PMD2_IC3MD_POSITION                     0x0000000A
#define _PMD2_IC3MD_MASK                         0x00000400
#define _PMD2_IC3MD_LENGTH                       0x00000001

#define _PMD2_IC4MD_POSITION                     0x0000000B
#define _PMD2_IC4MD_MASK                         0x00000800
#define _PMD2_IC4MD_LENGTH                       0x00000001

#define _PMD2_IC5MD_POSITION                     0x0000000C
#define _PMD2_IC5MD_MASK                         0x00001000
#define _PMD2_IC5MD_LENGTH                       0x00000001

#define _PMD2_IC6MD_POSITION                     0x0000000D
#define _PMD2_IC6MD_MASK                         0x00002000
#define _PMD2_IC6MD_LENGTH                       0x00000001

#define _PMD2_IC7MD_POSITION                     0x0000000E
#define _PMD2_IC7MD_MASK                         0x00004000
#define _PMD2_IC7MD_LENGTH                       0x00000001

#define _PMD2_IC8MD_POSITION                     0x0000000F
#define _PMD2_IC8MD_MASK                         0x00008000
#define _PMD2_IC8MD_LENGTH                       0x00000001

#define _PMD3_I2C2MD_POSITION                    0x00000001
#define _PMD3_I2C2MD_MASK                        0x00000002
#define _PMD3_I2C2MD_LENGTH                      0x00000001

#define _PMD3_I2C3MD_POSITION                    0x00000002
#define _PMD3_I2C3MD_MASK                        0x00000004
#define _PMD3_I2C3MD_LENGTH                      0x00000001

#define _PMD3_U3MD_POSITION                      0x00000003
#define _PMD3_U3MD_MASK                          0x00000008
#define _PMD3_U3MD_LENGTH                        0x00000001

#define _PMD3_CRCMD_POSITION                     0x00000007
#define _PMD3_CRCMD_MASK                         0x00000080
#define _PMD3_CRCMD_LENGTH                       0x00000001

#define _PMD3_PMPMD_POSITION                     0x00000008
#define _PMD3_PMPMD_MASK                         0x00000100
#define _PMD3_PMPMD_LENGTH                       0x00000001

#define _PMD3_RTCCMD_POSITION                    0x00000009
#define _PMD3_RTCCMD_MASK                        0x00000200
#define _PMD3_RTCCMD_LENGTH                      0x00000001

#define _PMD3_CMPMD_POSITION                     0x0000000A
#define _PMD3_CMPMD_MASK                         0x00000400
#define _PMD3_CMPMD_LENGTH                       0x00000001

#define _PMD3_CRCPMD_POSITION                    0x00000007
#define _PMD3_CRCPMD_MASK                        0x00000080
#define _PMD3_CRCPMD_LENGTH                      0x00000001

#define _PMD4_USB1MD_POSITION                    0x00000000
#define _PMD4_USB1MD_MASK                        0x00000001
#define _PMD4_USB1MD_LENGTH                      0x00000001

#define _PMD4_LVDMD_POSITION                     0x00000001
#define _PMD4_LVDMD_MASK                         0x00000002
#define _PMD4_LVDMD_LENGTH                       0x00000001

#define _PMD4_CTMUMD_POSITION                    0x00000002
#define _PMD4_CTMUMD_MASK                        0x00000004
#define _PMD4_CTMUMD_LENGTH                      0x00000001

#define _PMD4_REFOMD_POSITION                    0x00000003
#define _PMD4_REFOMD_MASK                        0x00000008
#define _PMD4_REFOMD_LENGTH                      0x00000001

#define _PMD4_U4MD_POSITION                      0x00000005
#define _PMD4_U4MD_MASK                          0x00000020
#define _PMD4_U4MD_LENGTH                        0x00000001

#define _PMD4_UPWMMD_POSITION                    0x00000006
#define _PMD4_UPWMMD_MASK                        0x00000040
#define _PMD4_UPWMMD_LENGTH                      0x00000001

#define _PMD5_OC9MD_POSITION                     0x00000000
#define _PMD5_OC9MD_MASK                         0x00000001
#define _PMD5_OC9MD_LENGTH                       0x00000001

#define _PMD5_IC9MD_POSITION                     0x00000008
#define _PMD5_IC9MD_MASK                         0x00000100
#define _PMD5_IC9MD_LENGTH                       0x00000001

#define _PMD6_SPI3MD_POSITION                    0x00000000
#define _PMD6_SPI3MD_MASK                        0x00000001
#define _PMD6_SPI3MD_LENGTH                      0x00000001

#define _PMD6_GFX1MD_POSITION                    0x00000006
#define _PMD6_GFX1MD_MASK                        0x00000040
#define _PMD6_GFX1MD_LENGTH                      0x00000001



/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Register CONFIG4 (0x2abf8)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _CONFIG4;
#define _CONFIG4(x) __attribute__((address(0x2abf8),deprecated_definition("consider migrating to #pragma config"),section("__CONFIG4.sec"),space(prog))) __prog__ uint16_t _CONFIG4 = (x);

/*
** Only one invocation of CONFIG4 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG4.
** Multiple options may be combined, as shown:
**
** _CONFIG4( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
*/

/* Register CONFIG3 (0x2abfa)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _CONFIG3;
#define _CONFIG3(x) __attribute__((address(0x2abfa),deprecated_definition("consider migrating to #pragma config"),section("__CONFIG3.sec"),space(prog))) __prog__ uint16_t _CONFIG3 = (x);

/*
** Only one invocation of CONFIG3 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG3.
** Multiple options may be combined, as shown:
**
** _CONFIG3( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Write Protection Flash Page Segment Boundary:
**     WPFP_WPFP0           Page 0 (0x00)
**     WPFP_WPFP1           Page 1 (0x400)
**     WPFP_WPFP2           Page 2 (0x800)
**     WPFP_WPFP3           Page 3 (0xC00)
**     WPFP_WPFP4           Page 4 (0x1000)
**     WPFP_WPFP5           Page 5 (0x1400)
**     WPFP_WPFP6           Page 6 (0x1800)
**     WPFP_WPFP7           Page 7 (0x1C00)
**     WPFP_WPFP8           Page 8 (0x2000)
**     WPFP_WPFP9           Page 9 (0x2400)
**     WPFP_WPFP10          Page 10 (0x2800)
**     WPFP_WPFP11          Page 11 (0x2C00)
**     WPFP_WPFP12          Page 12 (0x3000)
**     WPFP_WPFP13          Page 13 (0x3400)
**     WPFP_WPFP14          Page 14 (0x3800)
**     WPFP_WPFP15          Page 15 (0x3C00)
**     WPFP_WPFP16          Page 16 (0x4000)
**     WPFP_WPFP17          Page 17 (0x4400)
**     WPFP_WPFP18          Page 18 (0x4800)
**     WPFP_WPFP19          Page 19 (0x4C00)
**     WPFP_WPFP20          Page 20 (0x5000)
**     WPFP_WPFP21          Page 21 (0x5400)
**     WPFP_WPFP22          Page 22 (0x5800)
**     WPFP_WPFP23          Page 23 (0x5C00)
**     WPFP_WPFP24          Page 24 (0x6000)
**     WPFP_WPFP25          Page 25 (0x6400)
**     WPFP_WPFP26          Page 26 (0x6800)
**     WPFP_WPFP27          Page 27 (0x6C00)
**     WPFP_WPFP28          Page 28 (0x7000)
**     WPFP_WPFP29          Page 29 (0x7400)
**     WPFP_WPFP30          Page 30 (0x7800)
**     WPFP_WPFP31          Page 31 (0x7C00)
**     WPFP_WPFP32          Page 32 (0x8000)
**     WPFP_WPFP33          Page 33 (0x8400)
**     WPFP_WPFP34          Page 34 (0x8800)
**     WPFP_WPFP35          Page 35 (0x8C00)
**     WPFP_WPFP36          Page 36 (0x9000)
**     WPFP_WPFP37          Page 37 (0x9400)
**     WPFP_WPFP38          Page 38 (0x9800)
**     WPFP_WPFP39          Page 39 (0x9C00)
**     WPFP_WPFP40          Page 40 (0xA000)
**     WPFP_WPFP41          Page 41 (0xA400)
**     WPFP_WPFP42          Page 42 (0xA800)
**     WPFP_WPFP43          Page 43 (0xAC00)
**     WPFP_WPFP44          Page 44 (0xB000)
**     WPFP_WPFP45          Page 45 (0xB400)
**     WPFP_WPFP46          Page 46 (0xB800)
**     WPFP_WPFP47          Page 47 (0xBC00)
**     WPFP_WPFP48          Page 48 (0xC000)
**     WPFP_WPFP49          Page 49 (0xC400)
**     WPFP_WPFP50          Page 50 (0xC800)
**     WPFP_WPFP51          Page 51 (0xCC00)
**     WPFP_WPFP52          Page 52 (0xD000)
**     WPFP_WPFP53          Page 53 (0xD400)
**     WPFP_WPFP54          Page 54 (0xD800)
**     WPFP_WPFP55          Page 55 (0xDC00)
**     WPFP_WPFP56          Page 56 (0xE000)
**     WPFP_WPFP57          Page 57 (0xE400)
**     WPFP_WPFP58          Page 58 (0xE800)
**     WPFP_WPFP59          Page 59 (0xEC00)
**     WPFP_WPFP60          Page 60 (0xF000)
**     WPFP_WPFP61          Page 61 (0xF400)
**     WPFP_WPFP62          Page 62 (0xF800)
**     WPFP_WPFP63          Page 63 (0xFC00)
**     WPFP_WPFP64          Page 64 (0x10000)
**     WPFP_WPFP65          Page 65 (0x10400)
**     WPFP_WPFP66          Page 66 (0x10800)
**     WPFP_WPFP67          Page 67 (0x10C00)
**     WPFP_WPFP68          Page 68 (0x11000)
**     WPFP_WPFP69          Page 69 (0x11400)
**     WPFP_WPFP70          Page 70 (0x11800)
**     WPFP_WPFP71          Page 71 (0x11C00)
**     WPFP_WPFP72          Page 72 (0x12000)
**     WPFP_WPFP73          Page 73 (0x12400)
**     WPFP_WPFP74          Page 74 (0x12800)
**     WPFP_WPFP75          Page 75 (0x12C00)
**     WPFP_WPFP76          Page 76 (0x13000)
**     WPFP_WPFP77          Page 77 (0x13400)
**     WPFP_WPFP78          Page 78 (0x13800)
**     WPFP_WPFP79          Page 79 (0x13C00)
**     WPFP_WPFP80          Page 80 (0x14000)
**     WPFP_WPFP81          Page 81 (0x14400)
**     WPFP_WPFP82          Page 82 (0x14800)
**     WPFP_WPFP83          Page 83 (0x14C00)
**     WPFP_WPFP84          Page 84 (0x15000)
**     WPFP_WPFP85          Page 85 (0x15400)
**     WPFP_WPFP86          Page 86 (0x15800)
**     WPFP_WPFP87          Page 87 (0x15C00)
**     WPFP_WPFP88          Page 88 (0x16000)
**     WPFP_WPFP89          Page 89 (0x16400)
**     WPFP_WPFP90          Page 90 (0x16800)
**     WPFP_WPFP91          Page 91 (0x16C00)
**     WPFP_WPFP92          Page 92 (0x17000)
**     WPFP_WPFP93          Page 93 (0x17400)
**     WPFP_WPFP94          Page 94 (0x17800)
**     WPFP_WPFP95          Page 95 (0x17C00)
**     WPFP_WPFP96          Page 96 (0x18000)
**     WPFP_WPFP97          Page 97 (0x18400)
**     WPFP_WPFP98          Page 98 (0x18800)
**     WPFP_WPFP99          Page 99 (0x18C00)
**     WPFP_WPFP100         Page 100 (0x19000)
**     WPFP_WPFP101         Page 101 (0x19400)
**     WPFP_WPFP102         Page 102 (0x19800)
**     WPFP_WPFP103         Page 103 (0x19C00)
**     WPFP_WPFP104         Page 104 (0x1A000)
**     WPFP_WPFP105         Page 105 (0x1A400)
**     WPFP_WPFP106         Page 106 (0x1A800)
**     WPFP_WPFP107         Page 107 (0x1AC00)
**     WPFP_WPFP108         Page 108 (0x1B000)
**     WPFP_WPFP109         Page 109 (0x1B400)
**     WPFP_WPFP110         Page 110 (0x1B800)
**     WPFP_WPFP111         Page 111 (0x1BC00)
**     WPFP_WPFP112         Page 112 (0x1C000)
**     WPFP_WPFP113         Page 113 (0x1C400)
**     WPFP_WPFP114         Page 114 (0x1C800)
**     WPFP_WPFP115         Page 115 (0x1CC00)
**     WPFP_WPFP116         Page 116 (0x1D000)
**     WPFP_WPFP117         Page 117 (0x1D400)
**     WPFP_WPFP118         Page 118 (0x1D800)
**     WPFP_WPFP119         Page 119 (0x1DC00)
**     WPFP_WPFP120         Page 120 (0x1E000)
**     WPFP_WPFP121         Page 121 (0x1E400)
**     WPFP_WPFP122         Page 122 (0x1E800)
**     WPFP_WPFP123         Page 123 (0x1EC00)
**     WPFP_WPFP124         Page 124 (0x1F000)
**     WPFP_WPFP125         Page 125 (0x1F400)
**     WPFP_WPFP126         Page 126 (0x1F800)
**     WPFP_WPFP127         Page 127 (0x1FC00)
**     WPFP_WPFP128         Page 128 (0x20000)
**     WPFP_WPFP129         Page 129 (0x20400)
**     WPFP_WPFP130         Page 130 (0x20800)
**     WPFP_WPFP131         Page 131 (0x20C00)
**     WPFP_WPFP132         Page 132 (0x21000)
**     WPFP_WPFP133         Page 133 (0x21400)
**     WPFP_WPFP134         Page 134 (0x21800)
**     WPFP_WPFP135         Page 135 (0x21C00)
**     WPFP_WPFP136         Page 136 (0x22000)
**     WPFP_WPFP137         Page 137 (0x22400)
**     WPFP_WPFP138         Page 138 (0x22800)
**     WPFP_WPFP139         Page 139 (0x22C00)
**     WPFP_WPFP140         Page 140 (0x23000)
**     WPFP_WPFP141         Page 141 (0x23400)
**     WPFP_WPFP142         Page 142 (0x23800)
**     WPFP_WPFP143         Page 143 (0x23C00)
**     WPFP_WPFP144         Page 144 (0x24000)
**     WPFP_WPFP145         Page 145 (0x24400)
**     WPFP_WPFP146         Page 146 (0x24800)
**     WPFP_WPFP147         Page 147 (0x24C00)
**     WPFP_WPFP148         Page 148 (0x25000)
**     WPFP_WPFP149         Page 149 (0x25400)
**     WPFP_WPFP150         Page 150 (0x25800)
**     WPFP_WPFP151         Page 151 (0x25C00)
**     WPFP_WPFP152         Page 152 (0x26000)
**     WPFP_WPFP153         Page 153 (0x26400)
**     WPFP_WPFP154         Page 154 (0x26800)
**     WPFP_WPFP155         Page 155 (0x26C00)
**     WPFP_WPFP156         Page 156 (0x27000)
**     WPFP_WPFP157         Page 157 (0x27400)
**     WPFP_WPFP158         Page 158 (0x27800)
**     WPFP_WPFP159         Page 159 (0x27C00)
**     WPFP_WPFP160         Page 160 (0x28000)
**     WPFP_WPFP161         Page 161 (0x28400)
**     WPFP_WPFP162         Page 162 (0x28800)
**     WPFP_WPFP163         Page 163 (0x28C00)
**     WPFP_WPFP164         Page 164 (0x29000)
**     WPFP_WPFP165         Page 165 (0x29400)
**     WPFP_WPFP166         Page 166 (0x29800)
**     WPFP_WPFP167         Page 167 (0x29C00)
**     WPFP_WPFP168         Page 168 (0x2A000)
**     WPFP_WPFP169         Page 169 (0x2A400)
**     WPFP_WPFP170         Page 170 (0x2A800)
**     WPFP_WPFP255         Highest Page (same as page 170)
**
**   Secondary Oscillator Power Mode Select:
**     SOSCSEL_EC           External clock (SCLKI) or Digital I/O mode(
**     SOSCSEL_LPSOSC       Secondary oscillator is in Low-Power (low drive strength) Oscillator mode
**     SOSCSEL_SOSC         Secondary oscillator is in Default (high drive strength) Oscillator mode
**
**   Voltage Regulator Wake-up Time Select:
**     WUTSEL_FST           Fast regulator start-up time is used
**     WUTSEL_LEG           Default regulator start-up time is used
**
**   Alternate PMP Pin Mapping:
**     ALTPMP_ALTPMPEN      EPMP pins are in alternate location mode
**     ALTPMP_ALPMPDIS      EPMP pins are in default location mode
**
**   Segment Write Protection Disable:
**     WPDIS_WPEN           Segmented code protection is enabled; protected segment is defined by the WPEND, WPCFG and WPFPx Configuration bits
**     WPDIS_WPDIS          Segmented code protection is disabled
**
**   Write Protect Configuration Page Select:
**     WPCFG_WPCFGEN        Last page and Flash Configuration Words are write-protected, provided WPDIS = 0
**     WPCFG_WPCFGDIS       Last page (at the top of program memory) and Flash Configuration Words are not write-protected
**
**   Segment Write Protection End Page Select:
**     WPEND_WPSTARTMEM     Protected code segment lower boundary is at the bottom of the program memory (000000h); upper boundary is the code page specified by WPFP
**     WPEND_WPENDMEM       Protected code segment upper boundary is at the last page of program memory; the lower boundary is the code page specified by WPFP
**
*/

#define WPFP_WPFP0           0xFF00
#define WPFP_WPFP1           0xFF01
#define WPFP_WPFP2           0xFF02
#define WPFP_WPFP3           0xFF03
#define WPFP_WPFP4           0xFF04
#define WPFP_WPFP5           0xFF05
#define WPFP_WPFP6           0xFF06
#define WPFP_WPFP7           0xFF07
#define WPFP_WPFP8           0xFF08
#define WPFP_WPFP9           0xFF09
#define WPFP_WPFP10          0xFF0A
#define WPFP_WPFP11          0xFF0B
#define WPFP_WPFP12          0xFF0C
#define WPFP_WPFP13          0xFF0D
#define WPFP_WPFP14          0xFF0E
#define WPFP_WPFP15          0xFF0F
#define WPFP_WPFP16          0xFF10
#define WPFP_WPFP17          0xFF11
#define WPFP_WPFP18          0xFF12
#define WPFP_WPFP19          0xFF13
#define WPFP_WPFP20          0xFF14
#define WPFP_WPFP21          0xFF15
#define WPFP_WPFP22          0xFF16
#define WPFP_WPFP23          0xFF17
#define WPFP_WPFP24          0xFF18
#define WPFP_WPFP25          0xFF19
#define WPFP_WPFP26          0xFF1A
#define WPFP_WPFP27          0xFF1B
#define WPFP_WPFP28          0xFF1C
#define WPFP_WPFP29          0xFF1D
#define WPFP_WPFP30          0xFF1E
#define WPFP_WPFP31          0xFF1F
#define WPFP_WPFP32          0xFF20
#define WPFP_WPFP33          0xFF21
#define WPFP_WPFP34          0xFF22
#define WPFP_WPFP35          0xFF23
#define WPFP_WPFP36          0xFF24
#define WPFP_WPFP37          0xFF25
#define WPFP_WPFP38          0xFF26
#define WPFP_WPFP39          0xFF27
#define WPFP_WPFP40          0xFF28
#define WPFP_WPFP41          0xFF29
#define WPFP_WPFP42          0xFF2A
#define WPFP_WPFP43          0xFF2B
#define WPFP_WPFP44          0xFF2C
#define WPFP_WPFP45          0xFF2D
#define WPFP_WPFP46          0xFF2E
#define WPFP_WPFP47          0xFF2F
#define WPFP_WPFP48          0xFF30
#define WPFP_WPFP49          0xFF31
#define WPFP_WPFP50          0xFF32
#define WPFP_WPFP51          0xFF33
#define WPFP_WPFP52          0xFF34
#define WPFP_WPFP53          0xFF35
#define WPFP_WPFP54          0xFF36
#define WPFP_WPFP55          0xFF37
#define WPFP_WPFP56          0xFF38
#define WPFP_WPFP57          0xFF39
#define WPFP_WPFP58          0xFF3A
#define WPFP_WPFP59          0xFF3B
#define WPFP_WPFP60          0xFF3C
#define WPFP_WPFP61          0xFF3D
#define WPFP_WPFP62          0xFF3E
#define WPFP_WPFP63          0xFF3F
#define WPFP_WPFP64          0xFF40
#define WPFP_WPFP65          0xFF41
#define WPFP_WPFP66          0xFF42
#define WPFP_WPFP67          0xFF43
#define WPFP_WPFP68          0xFF44
#define WPFP_WPFP69          0xFF45
#define WPFP_WPFP70          0xFF46
#define WPFP_WPFP71          0xFF47
#define WPFP_WPFP72          0xFF48
#define WPFP_WPFP73          0xFF49
#define WPFP_WPFP74          0xFF4A
#define WPFP_WPFP75          0xFF4B
#define WPFP_WPFP76          0xFF4C
#define WPFP_WPFP77          0xFF4D
#define WPFP_WPFP78          0xFF4E
#define WPFP_WPFP79          0xFF4F
#define WPFP_WPFP80          0xFF50
#define WPFP_WPFP81          0xFF51
#define WPFP_WPFP82          0xFF52
#define WPFP_WPFP83          0xFF53
#define WPFP_WPFP84          0xFF54
#define WPFP_WPFP85          0xFF55
#define WPFP_WPFP86          0xFF56
#define WPFP_WPFP87          0xFF57
#define WPFP_WPFP88          0xFF58
#define WPFP_WPFP89          0xFF59
#define WPFP_WPFP90          0xFF5A
#define WPFP_WPFP91          0xFF5B
#define WPFP_WPFP92          0xFF5C
#define WPFP_WPFP93          0xFF5D
#define WPFP_WPFP94          0xFF5E
#define WPFP_WPFP95          0xFF5F
#define WPFP_WPFP96          0xFF60
#define WPFP_WPFP97          0xFF61
#define WPFP_WPFP98          0xFF62
#define WPFP_WPFP99          0xFF63
#define WPFP_WPFP100         0xFF64
#define WPFP_WPFP101         0xFF65
#define WPFP_WPFP102         0xFF66
#define WPFP_WPFP103         0xFF67
#define WPFP_WPFP104         0xFF68
#define WPFP_WPFP105         0xFF69
#define WPFP_WPFP106         0xFF6A
#define WPFP_WPFP107         0xFF6B
#define WPFP_WPFP108         0xFF6C
#define WPFP_WPFP109         0xFF6D
#define WPFP_WPFP110         0xFF6E
#define WPFP_WPFP111         0xFF6F
#define WPFP_WPFP112         0xFF70
#define WPFP_WPFP113         0xFF71
#define WPFP_WPFP114         0xFF72
#define WPFP_WPFP115         0xFF73
#define WPFP_WPFP116         0xFF74
#define WPFP_WPFP117         0xFF75
#define WPFP_WPFP118         0xFF76
#define WPFP_WPFP119         0xFF77
#define WPFP_WPFP120         0xFF78
#define WPFP_WPFP121         0xFF79
#define WPFP_WPFP122         0xFF7A
#define WPFP_WPFP123         0xFF7B
#define WPFP_WPFP124         0xFF7C
#define WPFP_WPFP125         0xFF7D
#define WPFP_WPFP126         0xFF7E
#define WPFP_WPFP127         0xFF7F
#define WPFP_WPFP128         0xFF80
#define WPFP_WPFP129         0xFF81
#define WPFP_WPFP130         0xFF82
#define WPFP_WPFP131         0xFF83
#define WPFP_WPFP132         0xFF84
#define WPFP_WPFP133         0xFF85
#define WPFP_WPFP134         0xFF86
#define WPFP_WPFP135         0xFF87
#define WPFP_WPFP136         0xFF88
#define WPFP_WPFP137         0xFF89
#define WPFP_WPFP138         0xFF8A
#define WPFP_WPFP139         0xFF8B
#define WPFP_WPFP140         0xFF8C
#define WPFP_WPFP141         0xFF8D
#define WPFP_WPFP142         0xFF8E
#define WPFP_WPFP143         0xFF8F
#define WPFP_WPFP144         0xFF90
#define WPFP_WPFP145         0xFF91
#define WPFP_WPFP146         0xFF92
#define WPFP_WPFP147         0xFF93
#define WPFP_WPFP148         0xFF94
#define WPFP_WPFP149         0xFF95
#define WPFP_WPFP150         0xFF96
#define WPFP_WPFP151         0xFF97
#define WPFP_WPFP152         0xFF98
#define WPFP_WPFP153         0xFF99
#define WPFP_WPFP154         0xFF9A
#define WPFP_WPFP155         0xFF9B
#define WPFP_WPFP156         0xFF9C
#define WPFP_WPFP157         0xFF9D
#define WPFP_WPFP158         0xFF9E
#define WPFP_WPFP159         0xFF9F
#define WPFP_WPFP160         0xFFA0
#define WPFP_WPFP161         0xFFA1
#define WPFP_WPFP162         0xFFA2
#define WPFP_WPFP163         0xFFA3
#define WPFP_WPFP164         0xFFA4
#define WPFP_WPFP165         0xFFA5
#define WPFP_WPFP166         0xFFA6
#define WPFP_WPFP167         0xFFA7
#define WPFP_WPFP168         0xFFA8
#define WPFP_WPFP169         0xFFA9
#define WPFP_WPFP170         0xFFAA
#define WPFP_WPFP255         0xFFFF

